app/controllers/secret/signature_controller.rb

SELECT "session_keys".* FROM "session_keys"
---
  def index
    from = params[:from] || 1
    to = params[:to] || 100
    result = SessionKey.all[from -1 , to]

SELECT  "session_keys".* FROM "session_keys" WHERE "session_keys"."rdSession" = ? LIMIT ?  [["rdSession", "jVDXgxOw3qJTppC+vbieXjZmoxCByDQkU+PV8Fh7Jcnn+W+wbsvZrQWyK1ab\n43UU\n"], ["LIMIT", 1]]
---
  def scan
    rdSession = params[:rdSession] || ''
    rawData = params[:rawData] || ''
    signature = params[:signature] || ''
    lng = params[:lng] || ''
    lat = params[:lat] || ''
    timestamp = params[:timestamp] || ''
    if rdSession.length > 0
      if SessionKey.where(:rdSession => rdSession).length == 0