app/controllers/file_controller.rb

SELECT "file_stores".* FROM "file_stores"
---
  def download
    fileList = FileStore.all