app/controllers/wechat_controller.rb

SELECT "session_keys".* FROM "session_keys" WHERE "session_keys"."rdSession" = ?  [["rdSession", "lJE2+AF1S7DwUC5FfF3FkpneK89NDUPx2j76MBNMrujvsdh9yVUviCbzujQl\npNAA\n"]]
SELECT "scans".* FROM "scans" WHERE (created_at > '2018-07-27 07:46:39.379969')
SELECT "scans".* FROM "scans" ORDER BY "scans"."created_at" DESC
---
  def index
    # from = params[:from] || 1
    # to = params[:to] || 100
    time = params[:time] || ''
    cate = params[:cate] || ''
    rdSession = params[:rdSession] || ''
    if rdSession.length > 0 && SessionKey.where(:rdSession => rdSession).length > 0
      if time == '0' # 一月之内
        if cate == '0' # 一月之内典型信息
          typical = []
          result = Scan.where("created_at > ?",Time.now - 1.month)
          result.each do |item|

SELECT  "session_keys".* FROM "session_keys" WHERE "session_keys"."rdSession" = ? LIMIT ?  [["rdSession", "DG7JgZ0U0cAYPhFMr+CKDrfEQd0daOue0izhsXAEoyzasL6x2rPCa9tqGpEM\ncRpltz1ObfIq//wc+IRP1JEWXA==\n"], ["LIMIT", 1]]
---
  def decode
    rdSession = params[:rdSession] || ''
    encryptedData = params[:encryptedData] || ''
    sym_key = params[:key] || ''
    sym_iv = params[:iv] || ''
    if encryptedData.length > 0 && rdSession.length > 0 && sym_key.length >0 && sym_iv.length > 0 && SessionKey.where(:rdSession => rdSession).length > 0